Oscillating Mesh Case/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location	"constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh	dynamicMotionSolverFvMesh;

//motionSolverLibs ("libfvMotionSolvers.so");
libs
(
 "libmyMotions.so"
);

motionSolver	solidBody;
cellZone	Circle;
solidBodyMotionFunction MyoscillatingRotatingMotion;
	MyoscillatingRotatingMotionCoeffs
	{
	origin          (0 0 0);
	amplitude       (0 0 1);  //units of rad
	omega           7.5;       //units of rad/s
	}





// ************************************************************************* //
